3B/SE464/src/12-Quality-Attributes.org
#+title: Quality Attributes
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Quality Attributes
Includes _reliability_, _availability_, _portability_, _scalability_,
and _performance_.

*Information Capture and Dissemination Environment (ICDE)*: software system for
providing intelligent assistance to analysts and researchers

ICDE automatically captures and stores data of actions performed by a user.
Data can later by used by 3rd parties to offer intelligent help.

ICDE business goals:
- encourage 3rd party tool developers
  - _integration_: simple and reliable programmatic access to data store for
    3rd party tools
  - _portability_: heterogeneous platform support for running 3rd party
    tools
  - _reliability_: allow 3rd party tools to communicate with ICDE users from a
    remote machine
- promote ICDE concept to users
  - _scalability_: scale data collection and data store components to support
    up to 150 users at a single site
  - _scalability_: low-cost deployment for each ICDE user workstation

Quality attributes must be made precise/measurable for a given system design.

** Performance
Different ways to measure performance include: throughput, response time,
deadlines

Enterprise applications often have strict performance requirements.

*** Throughput
Measure of amount of work an application must perform in unit time.

Required throughput can be average or peak.

Many systems have low average but high peak throughput requirements.

*** Response Time
Measure of latency an application exhibits in processing a request.

Usually measured in milliseconds, and often an important metric for users.

Required response time can be guaranteed or average.

*** Deadlines
Something must be completed before some specified time.
Most often associated with batch jobs in IT systems.

*** Issues
Overheads of trapping user events must be imperceptible to ICDE users
(response time).
Solution is to decouple user event capture from storage using a queue.

** Scalability
Main scalability issues are request load, connections, data size, and deployments

*** Request Load
How an application behaves when simultaneous load grows.

Ideal solution, without additional hardware capacity is: as the load increases, throughput remain
constant and response time per request increases only linearly.

Can scale by adding more hardware: scale-out \to horizontal or scale-up \to vertical

In reality, applications will exhibit a decrease in throughput and a subsequent exponential increase
in response time:
- increased load causes increased _resource contention_ (CPU, network, memory)
- each request consumes some additional resource (buffer space, locks, etc) in the application,
  and eventually these are exhausted

*** Connections
When the number of simultaneous connections to an application increases.
Each connections consumes some resources and this can exceed the maximum number of connections.

*** Data Size
How an application behaves as the data it processes increases in size.

*** Deployment
How effort to install/deploy an application increases as installation base grows, by installing new
users or new servers.

Solutions typically revolve around automatic download/installation.

