3B/SE464/12-Quality-Attributes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-10 Tue 15:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quality Attributes</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Quality Attributes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org667d2e3">1. Quality Attributes</a>
<ul>
<li><a href="#orgba63cfc">1.1. Performance</a>
<ul>
<li><a href="#org6091d27">1.1.1. Throughput</a></li>
<li><a href="#org0acf234">1.1.2. Response Time</a></li>
<li><a href="#orga2297bc">1.1.3. Deadlines</a></li>
<li><a href="#org37a3187">1.1.4. Issues</a></li>
</ul>
</li>
<li><a href="#org6f700be">1.2. Scalability</a>
<ul>
<li><a href="#org96b9c34">1.2.1. Request Load</a></li>
<li><a href="#org69f57ff">1.2.2. Connections</a></li>
<li><a href="#org4659abf">1.2.3. Data Size</a></li>
<li><a href="#org59b6cfb">1.2.4. Deployment</a></li>
<li><a href="#org03dd91b">1.2.5. ICDE</a></li>
</ul>
</li>
<li><a href="#org682ed7e">1.3. Modifiability</a>
<ul>
<li><a href="#org136c4dd">1.3.1. Analysis</a></li>
<li><a href="#orged66a9a">1.3.2. ICDE</a></li>
</ul>
</li>
<li><a href="#org3d42582">1.4. Security</a>
<ul>
<li><a href="#orgeecbb08">1.4.1. ICDE Requirements</a></li>
</ul>
</li>
<li><a href="#orgfec9749">1.5. Availability</a>
<ul>
<li><a href="#orgefe784b">1.5.1. ICDE</a></li>
</ul>
</li>
<li><a href="#org35beb6c">1.6. Integration</a>
<ul>
<li><a href="#orgae7c35f">1.6.1. Strategies</a></li>
<li><a href="#org218a6c7">1.6.2. ICDE</a></li>
</ul>
</li>
<li><a href="#org3dfbeb2">1.7. Other Quality Attributes</a>
<ul>
<li><a href="#org2c76141">1.7.1. Portability</a></li>
<li><a href="#org1077861">1.7.2. Testability</a></li>
<li><a href="#orgcfc82d0">1.7.3. Supportablity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org42e4d88">2. Design Trade-offs</a></li>
</ul>
</div>
</div>
<div id="outline-container-org667d2e3" class="outline-2">
<h2 id="org667d2e3"><span class="section-number-2">1.</span> Quality Attributes</h2>
<div class="outline-text-2" id="text-1">
<p>
Includes <span class="underline">reliability</span>, <span class="underline">availability</span>, <span class="underline">portability</span>, <span class="underline">scalability</span>,
and <span class="underline">performance</span>.
</p>

<p>
<b>Information Capture and Dissemination Environment (ICDE)</b>: software system for
providing intelligent assistance to analysts and researchers
</p>

<p>
ICDE automatically captures and stores data of actions performed by a user.
Data can later by used by 3rd parties to offer intelligent help.
</p>

<p>
ICDE business goals:
</p>
<ul class="org-ul">
<li>encourage 3rd party tool developers
<ul class="org-ul">
<li><span class="underline">integration</span>: simple and reliable programmatic access to data store for
3rd party tools</li>
<li><span class="underline">portability</span>: heterogeneous platform support for running 3rd party
tools</li>
<li><span class="underline">reliability</span>: allow 3rd party tools to communicate with ICDE users from a
remote machine</li>
</ul></li>
<li>promote ICDE concept to users
<ul class="org-ul">
<li><span class="underline">scalability</span>: scale data collection and data store components to support
up to 150 users at a single site</li>
<li><span class="underline">scalability</span>: low-cost deployment for each ICDE user workstation</li>
</ul></li>
</ul>

<p>
Quality attributes must be made precise/measurable for a given system design.
</p>
</div>
<div id="outline-container-orgba63cfc" class="outline-3">
<h3 id="orgba63cfc"><span class="section-number-3">1.1.</span> Performance</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Different ways to measure performance include: throughput, response time,
deadlines
</p>

<p>
Enterprise applications often have strict performance requirements.
</p>
</div>
<div id="outline-container-org6091d27" class="outline-4">
<h4 id="org6091d27"><span class="section-number-4">1.1.1.</span> Throughput</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Measure of amount of work an application must perform in unit time.
</p>

<p>
Required throughput can be average or peak.
</p>

<p>
Many systems have low average but high peak throughput requirements.
</p>
</div>
</div>
<div id="outline-container-org0acf234" class="outline-4">
<h4 id="org0acf234"><span class="section-number-4">1.1.2.</span> Response Time</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Measure of latency an application exhibits in processing a request.
</p>

<p>
Usually measured in milliseconds, and often an important metric for users.
</p>

<p>
Required response time can be guaranteed or average.
</p>
</div>
</div>
<div id="outline-container-orga2297bc" class="outline-4">
<h4 id="orga2297bc"><span class="section-number-4">1.1.3.</span> Deadlines</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Something must be completed before some specified time.
Most often associated with batch jobs in IT systems.
</p>
</div>
</div>
<div id="outline-container-org37a3187" class="outline-4">
<h4 id="org37a3187"><span class="section-number-4">1.1.4.</span> Issues</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Overheads of trapping user events must be imperceptible to ICDE users
(response time).
Solution is to decouple user event capture from storage using a queue.
</p>
</div>
</div>
</div>
<div id="outline-container-org6f700be" class="outline-3">
<h3 id="org6f700be"><span class="section-number-3">1.2.</span> Scalability</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Main scalability issues are request load, connections, data size, and deployments
</p>
</div>
<div id="outline-container-org96b9c34" class="outline-4">
<h4 id="org96b9c34"><span class="section-number-4">1.2.1.</span> Request Load</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
How an application behaves when simultaneous load grows.
</p>

<p>
Ideal solution, without additional hardware capacity is: as the load increases, throughput remain
constant and response time per request increases only linearly.
</p>

<p>
Can scale by adding more hardware: scale-out &rarr; horizontal or scale-up &rarr; vertical
</p>

<p>
In reality, applications will exhibit a decrease in throughput and a subsequent exponential increase
in response time:
</p>
<ul class="org-ul">
<li>increased load causes increased <span class="underline">resource contention</span> (CPU, network, memory)</li>
<li>each request consumes some additional resource (buffer space, locks, etc) in the application,
and eventually these are exhausted</li>
</ul>
</div>
</div>
<div id="outline-container-org69f57ff" class="outline-4">
<h4 id="org69f57ff"><span class="section-number-4">1.2.2.</span> Connections</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
When the number of simultaneous connections to an application increases.
Each connections consumes some resources and this can exceed the maximum number of connections.
</p>
</div>
</div>
<div id="outline-container-org4659abf" class="outline-4">
<h4 id="org4659abf"><span class="section-number-4">1.2.3.</span> Data Size</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
How an application behaves as the data it processes increases in size.
</p>
</div>
</div>
<div id="outline-container-org59b6cfb" class="outline-4">
<h4 id="org59b6cfb"><span class="section-number-4">1.2.4.</span> Deployment</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
How effort to install/deploy an application increases as installation base grows, by installing new
users or new servers.
</p>

<p>
Solutions typically revolve around automatic download/installation.
</p>
</div>
</div>
