3B/SE464/12-Quality-Attributes.tex
% Created 2024-12-10 Tue 15:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Quality Attributes}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Quality Attributes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Quality Attributes}
\label{sec:org2d61fed}
Includes \uline{reliability}, \uline{availability}, \uline{portability}, \uline{scalability},
and \uline{performance}.

\textbf{Information Capture and Dissemination Environment (ICDE)}: software system for
providing intelligent assistance to analysts and researchers

ICDE automatically captures and stores data of actions performed by a user.
Data can later by used by 3rd parties to offer intelligent help.

ICDE business goals:
\begin{itemize}
\item encourage 3rd party tool developers
\begin{itemize}
\item \uline{integration}: simple and reliable programmatic access to data store for
3rd party tools
\item \uline{portability}: heterogeneous platform support for running 3rd party
tools
\item \uline{reliability}: allow 3rd party tools to communicate with ICDE users from a
remote machine
\end{itemize}
\item promote ICDE concept to users
\begin{itemize}
\item \uline{scalability}: scale data collection and data store components to support
up to 150 users at a single site
\item \uline{scalability}: low-cost deployment for each ICDE user workstation
\end{itemize}
\end{itemize}

Quality attributes must be made precise/measurable for a given system design.
\subsection{Performance}
\label{sec:orgb90df7a}
Different ways to measure performance include: throughput, response time,
deadlines

Enterprise applications often have strict performance requirements.
\subsubsection{Throughput}
\label{sec:orgbe0bbbb}
Measure of amount of work an application must perform in unit time.

Required throughput can be average or peak.

Many systems have low average but high peak throughput requirements.
\subsubsection{Response Time}
\label{sec:org7590cb9}
Measure of latency an application exhibits in processing a request.

Usually measured in milliseconds, and often an important metric for users.

Required response time can be guaranteed or average.
\subsubsection{Deadlines}
\label{sec:org80fb85a}
Something must be completed before some specified time.
Most often associated with batch jobs in IT systems.
\subsubsection{Issues}
\label{sec:org41bc076}
Overheads of trapping user events must be imperceptible to ICDE users
(response time).
Solution is to decouple user event capture from storage using a queue.
\subsection{Scalability}
\label{sec:org4cfdd03}
Main scalability issues are request load, connections, data size, and deployments
\subsubsection{Request Load}
\label{sec:org41de869}
How an application behaves when simultaneous load grows.

Ideal solution, without additional hardware capacity is: as the load increases, throughput remain
constant and response time per request increases only linearly.

Can scale by adding more hardware: scale-out \(\to\) horizontal or scale-up \(\to\) vertical

In reality, applications will exhibit a decrease in throughput and a subsequent exponential increase
in response time:
\begin{itemize}
\item increased load causes increased \uline{resource contention} (CPU, network, memory)
\item each request consumes some additional resource (buffer space, locks, etc) in the application,
and eventually these are exhausted
\end{itemize}
\subsubsection{Connections}
\label{sec:org9f9df95}
When the number of simultaneous connections to an application increases.
Each connections consumes some resources and this can exceed the maximum number of connections.
\subsubsection{Data Size}
\label{sec:orgdf516a3}
How an application behaves as the data it processes increases in size.
\subsubsection{Deployment}
\label{sec:orgc47caaa}
How effort to install/deploy an application increases as installation base grows, by installing new
users or new servers.

Solutions typically revolve around automatic download/installation.
