3B/SE464/src/12-Quality-Attributes.org
*** ICDE
Scalability often overlooked but is a major cause of application failure.
Also hard to predict/test/validate.

Reliance on proven designs and technologies is essential.

For ICDE, application should be capable of handling a peak load of 150 concurrent requests from ICDE
clients.
Relatively easy to simulate user load to validate this.

** Modifiability
Modifications to a software system during its lifetime are certain.
Modifiable systems are easier to change/evolve.

Assess modifiability in context of how a system is likely to change.
No need to facilitate changes that are unlikely to occur, so avoid over-engineering.

Modifiability measures how easy it may be to change an application to cater for new functional
or non-functional requirements.

Must estimate cost and effort of modifiability.

Scenarios could involve new features, replacing components, or porting applications.

*** Analysis
Impact not easy to quantify.

Best possible is:
- convincing impact analysis of changes needed
- demo of how solution can accommodate modification without change

Minimizing dependencies increases modifiablity.
Changes isolated to single components are likely to be less expensive than those that affect other
components as well.

*** ICDE
Range of events trapped and stored by ICDE client to be expanded.

3rd party tools communicate new message types.

Change DB or server technology user.

** Security
Difficult and specialized multi-faceted quality attribute.

Much technology available, but requires deep knowledge of approaches and solution.

*Authentication*: applications can verify identity of users and other applications with which
they communicate

*Authorization*: authenticated users and applications have defined access rights to system resources

*Encryption*: messages sent to/from application are encrypted

*Integrity*: ensures message contents are not altered in transit

*Non-repudiation*: message sender has proof of delivery and receiver is assured of sender's identity,
so neither can subsequently refute participation in message exchange

Approaches include:
- internet application security (SSL, PKI)
- authentication and authorization in Java (JAAS)
- OS security
- DB security

*** ICDE Requirements
Authentication of ICDE users and 3rd party ICDE tools to ICDE server.

Encryption of data to ICDE server from 3rd party tools/users executing remotely over
an insecure network.

** Availability
Requirement for most IT applications.

Measured by the proportion of required time it is usable.

Related to reliability, unreliable \Rightarrow poor availability.

Period of loss of availability determined by:
- time to detect failure
- time to correct failure
- time to restart application

Strategies for high availability:
- eliminate single points of failure
- replication and failover
- automatic detection and restart

*Recoverability*: capability to reestablish performance levels and recover affected data after an
application or system failure

*** ICDE
Achieve 100% availability during business hours.

Plenty of scope for downtime for system upgrade, backup, and maintenance.

Include mechanisms for component replication and failover.

** Integration
Ease with which application can be incorporated into broader application context.

Achieved by programmatic APIs and data integration.

*** Strategies
Expose application data for access by other components.

Offer services to read/write application data through an abstracted interface.

*** ICDE
Revolve around need to support 3rd party analysis tools.

Well-defined and understood mechanism for 3rd party tools to access data in the ICDE data store.

** Other Quality Attributes
*** Portability
If an application can be easily executed on a different software/hardware platform to the one
it has been developed for.

*** Testability
The ease at which an application can be tested.

*** Supportablity
The ease at which an application can be supported once it is deployed.


