3B/SE464/12-Quality-Attributes.html
<div id="outline-container-org03dd91b" class="outline-4">
<h4 id="org03dd91b"><span class="section-number-4">1.2.5.</span> ICDE</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Scalability often overlooked but is a major cause of application failure.
Also hard to predict/test/validate.
</p>

<p>
Reliance on proven designs and technologies is essential.
</p>

<p>
For ICDE, application should be capable of handling a peak load of 150 concurrent requests from ICDE
clients.
Relatively easy to simulate user load to validate this.
</p>
</div>
</div>
</div>
<div id="outline-container-org682ed7e" class="outline-3">
<h3 id="org682ed7e"><span class="section-number-3">1.3.</span> Modifiability</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Modifications to a software system during its lifetime are certain.
Modifiable systems are easier to change/evolve.
</p>

<p>
Assess modifiability in context of how a system is likely to change.
No need to facilitate changes that are unlikely to occur, so avoid over-engineering.
</p>

<p>
Modifiability measures how easy it may be to change an application to cater for new functional
or non-functional requirements.
</p>

<p>
Must estimate cost and effort of modifiability.
</p>

<p>
Scenarios could involve new features, replacing components, or porting applications.
</p>
</div>
<div id="outline-container-org136c4dd" class="outline-4">
<h4 id="org136c4dd"><span class="section-number-4">1.3.1.</span> Analysis</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Impact not easy to quantify.
</p>

<p>
Best possible is:
</p>
<ul class="org-ul">
<li>convincing impact analysis of changes needed</li>
<li>demo of how solution can accommodate modification without change</li>
</ul>

<p>
Minimizing dependencies increases modifiablity.
Changes isolated to single components are likely to be less expensive than those that affect other
components as well.
</p>
</div>
</div>
<div id="outline-container-orged66a9a" class="outline-4">
<h4 id="orged66a9a"><span class="section-number-4">1.3.2.</span> ICDE</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Range of events trapped and stored by ICDE client to be expanded.
</p>

<p>
3rd party tools communicate new message types.
</p>

<p>
Change DB or server technology user.
</p>
</div>
</div>
</div>
<div id="outline-container-org3d42582" class="outline-3">
<h3 id="org3d42582"><span class="section-number-3">1.4.</span> Security</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Difficult and specialized multi-faceted quality attribute.
</p>

<p>
Much technology available, but requires deep knowledge of approaches and solution.
</p>

<p>
<b>Authentication</b>: applications can verify identity of users and other applications with which
they communicate
</p>

<p>
<b>Authorization</b>: authenticated users and applications have defined access rights to system resources
</p>

<p>
<b>Encryption</b>: messages sent to/from application are encrypted
</p>

<p>
<b>Integrity</b>: ensures message contents are not altered in transit
</p>

<p>
<b>Non-repudiation</b>: message sender has proof of delivery and receiver is assured of sender&rsquo;s identity,
so neither can subsequently refute participation in message exchange
</p>

<p>
Approaches include:
</p>
<ul class="org-ul">
<li>internet application security (SSL, PKI)</li>
<li>authentication and authorization in Java (JAAS)</li>
<li>OS security</li>
<li>DB security</li>
</ul>
</div>
<div id="outline-container-orgeecbb08" class="outline-4">
<h4 id="orgeecbb08"><span class="section-number-4">1.4.1.</span> ICDE Requirements</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Authentication of ICDE users and 3rd party ICDE tools to ICDE server.
</p>

<p>
Encryption of data to ICDE server from 3rd party tools/users executing remotely over
an insecure network.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfec9749" class="outline-3">
<h3 id="orgfec9749"><span class="section-number-3">1.5.</span> Availability</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Requirement for most IT applications.
</p>

<p>
Measured by the proportion of required time it is usable.
</p>

<p>
Related to reliability, unreliable &rArr; poor availability.
</p>

<p>
Period of loss of availability determined by:
</p>
<ul class="org-ul">
<li>time to detect failure</li>
<li>time to correct failure</li>
<li>time to restart application</li>
</ul>

<p>
Strategies for high availability:
</p>
<ul class="org-ul">
<li>eliminate single points of failure</li>
<li>replication and failover</li>
<li>automatic detection and restart</li>
</ul>

<p>
<b>Recoverability</b>: capability to reestablish performance levels and recover affected data after an
application or system failure
</p>
</div>
<div id="outline-container-orgefe784b" class="outline-4">
<h4 id="orgefe784b"><span class="section-number-4">1.5.1.</span> ICDE</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Achieve 100% availability during business hours.
</p>

<p>
Plenty of scope for downtime for system upgrade, backup, and maintenance.
</p>

<p>
Include mechanisms for component replication and failover.
</p>
</div>
</div>
</div>
<div id="outline-container-org35beb6c" class="outline-3">
<h3 id="org35beb6c"><span class="section-number-3">1.6.</span> Integration</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Ease with which application can be incorporated into broader application context.
</p>

<p>
Achieved by programmatic APIs and data integration.
</p>
</div>
<div id="outline-container-orgae7c35f" class="outline-4">
<h4 id="orgae7c35f"><span class="section-number-4">1.6.1.</span> Strategies</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Expose application data for access by other components.
</p>

<p>
Offer services to read/write application data through an abstracted interface.
</p>
</div>
</div>
<div id="outline-container-org218a6c7" class="outline-4">
<h4 id="org218a6c7"><span class="section-number-4">1.6.2.</span> ICDE</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Revolve around need to support 3rd party analysis tools.
</p>

<p>
Well-defined and understood mechanism for 3rd party tools to access data in the ICDE data store.
</p>
</div>
</div>
</div>
<div id="outline-container-org3dfbeb2" class="outline-3">
<h3 id="org3dfbeb2"><span class="section-number-3">1.7.</span> Other Quality Attributes</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org2c76141" class="outline-4">
<h4 id="org2c76141"><span class="section-number-4">1.7.1.</span> Portability</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
If an application can be easily executed on a different software/hardware platform to the one
it has been developed for.
</p>
</div>
</div>
<div id="outline-container-org1077861" class="outline-4">
<h4 id="org1077861"><span class="section-number-4">1.7.2.</span> Testability</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
The ease at which an application can be tested.
</p>
</div>
</div>
<div id="outline-container-orgcfc82d0" class="outline-4">
<h4 id="orgcfc82d0"><span class="section-number-4">1.7.3.</span> Supportablity</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
The ease at which an application can be supported once it is deployed.
</p>
</div>
</div>
</div>
</div>
