3B/SE464/12-Quality-Attributes.tex
\subsubsection{ICDE}
\label{sec:org4fa01c4}
Scalability often overlooked but is a major cause of application failure.
Also hard to predict/test/validate.

Reliance on proven designs and technologies is essential.

For ICDE, application should be capable of handling a peak load of 150 concurrent requests from ICDE
clients.
Relatively easy to simulate user load to validate this.
\subsection{Modifiability}
\label{sec:org3124182}
Modifications to a software system during its lifetime are certain.
Modifiable systems are easier to change/evolve.

Assess modifiability in context of how a system is likely to change.
No need to facilitate changes that are unlikely to occur, so avoid over-engineering.

Modifiability measures how easy it may be to change an application to cater for new functional
or non-functional requirements.

Must estimate cost and effort of modifiability.

Scenarios could involve new features, replacing components, or porting applications.
\subsubsection{Analysis}
\label{sec:org8b5acd3}
Impact not easy to quantify.

Best possible is:
\begin{itemize}
\item convincing impact analysis of changes needed
\item demo of how solution can accommodate modification without change
\end{itemize}

Minimizing dependencies increases modifiablity.
Changes isolated to single components are likely to be less expensive than those that affect other
components as well.
\subsubsection{ICDE}
\label{sec:org27d4958}
Range of events trapped and stored by ICDE client to be expanded.

3rd party tools communicate new message types.

Change DB or server technology user.
\subsection{Security}
\label{sec:org557f510}
Difficult and specialized multi-faceted quality attribute.

Much technology available, but requires deep knowledge of approaches and solution.

\textbf{Authentication}: applications can verify identity of users and other applications with which
they communicate

\textbf{Authorization}: authenticated users and applications have defined access rights to system resources

\textbf{Encryption}: messages sent to/from application are encrypted

\textbf{Integrity}: ensures message contents are not altered in transit

\textbf{Non-repudiation}: message sender has proof of delivery and receiver is assured of sender's identity,
so neither can subsequently refute participation in message exchange

Approaches include:
\begin{itemize}
\item internet application security (SSL, PKI)
\item authentication and authorization in Java (JAAS)
\item OS security
\item DB security
\end{itemize}
\subsubsection{ICDE Requirements}
\label{sec:orga12c1bb}
Authentication of ICDE users and 3rd party ICDE tools to ICDE server.

Encryption of data to ICDE server from 3rd party tools/users executing remotely over
an insecure network.
\subsection{Availability}
\label{sec:orged32bd6}
Requirement for most IT applications.

Measured by the proportion of required time it is usable.

Related to reliability, unreliable \(\Rightarrow\) poor availability.

Period of loss of availability determined by:
\begin{itemize}
\item time to detect failure
\item time to correct failure
\item time to restart application
\end{itemize}

Strategies for high availability:
\begin{itemize}
\item eliminate single points of failure
\item replication and failover
\item automatic detection and restart
\end{itemize}

\textbf{Recoverability}: capability to reestablish performance levels and recover affected data after an
application or system failure
\subsubsection{ICDE}
\label{sec:org25a4109}
Achieve 100\% availability during business hours.

Plenty of scope for downtime for system upgrade, backup, and maintenance.

Include mechanisms for component replication and failover.
\subsection{Integration}
\label{sec:orgc3be8ca}
Ease with which application can be incorporated into broader application context.

Achieved by programmatic APIs and data integration.
\subsubsection{Strategies}
\label{sec:org042e6da}
Expose application data for access by other components.

Offer services to read/write application data through an abstracted interface.
\subsubsection{ICDE}
\label{sec:org55d3646}
Revolve around need to support 3rd party analysis tools.

Well-defined and understood mechanism for 3rd party tools to access data in the ICDE data store.
\subsection{Other Quality Attributes}
\label{sec:org8c5c568}
\subsubsection{Portability}
\label{sec:org2973397}
If an application can be easily executed on a different software/hardware platform to the one
it has been developed for.
\subsubsection{Testability}
\label{sec:org1503e0e}
The ease at which an application can be tested.
\subsubsection{Supportablity}
\label{sec:orgcb7ae82}
The ease at which an application can be supported once it is deployed.
