3B/SE464/src/12-Quality-Attributes.org
* Design Trade-offs
Quality attributes interact with and affect each other.

Architects must create solutions that make sensible compromises since it is not possible to satisfy
all competing requirements.

Still, must satisfy all stakeholder needs, which is difficult.
