3B/SE464/12-Quality-Attributes.html
<div id="outline-container-org42e4d88" class="outline-2">
<h2 id="org42e4d88"><span class="section-number-2">2.</span> Design Trade-offs</h2>
<div class="outline-text-2" id="text-2">
<p>
Quality attributes interact with and affect each other.
</p>

<p>
Architects must create solutions that make sensible compromises since it is not possible to satisfy
all competing requirements.
</p>

<p>
Still, must satisfy all stakeholder needs, which is difficult.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-10 Tue 15:00</p>
</div>
</body>
</html>
