3B/SE464/12-Quality-Attributes.tex
\section{Design Trade-offs}
\label{sec:orga72750b}
Quality attributes interact with and affect each other.

Architects must create solutions that make sensible compromises since it is not possible to satisfy
all competing requirements.

Still, must satisfy all stakeholder needs, which is difficult.
\end{document}
